Revit 2024 API
LoadBase.IsConstrainedOnHost Property
 The load is constrained to host or not.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsConstrainedOnHost { get; }
Visual Basic
Public ReadOnly Property IsConstrainedOnHost As Boolean
	Get
Visual C++
public:
property bool IsConstrainedOnHost {
	bool get ();
}
See Also
LoadBase Class
Autodesk.Revit.DB.Structure Namespace